{
  "entries": [
    {
      "id": 1,
      "date": "10/7/2020",
      "concept": "follow the bouncing ball",
      "entry": "Jisie walked us through sorting the fish we created in the Martin's Aquarium excercise using a data provider module and functions to sort and then create html for our fish.",
      "mood": "confused"
    },
    {
      "id": 2,
      "date": "10/8/2020",
      "concept": "testing our code",
      "entry": "Madi did a great walkthrough of how to test our code using bebugger, console.log(), and breakpoint.",
      "mood": "happy"
    },
    {
      "id": 3,
      "date": "10/9/2020",
      "concept": "git, importing functions in JS, remainder operators",
      "entry": "Worked on creating a data provider array module and the functions to sort that array into new arrays and create html representations of the objects in those arrays.",
      "mood": "excited"
    },
    {
      "id": 4,
      "date": "10/12/2020",
      "concept": "dependency graph, testing, pseudo coding",
      "entry": "Madi walked us through making a dependency graph and building single-responsibility modules. It was super helpful. I still feel behind, though.",
      "mood": "sad"
    },
    {
      "date": "2020-10-13",
      "concept": "2nd Group Project",
      "entry": "Worked with Jayna and David B on our second group project. I love working with them. Learned from David to keep a scratch.txt file to throw code and notes that you might want later. Also learned git diff {file name} to see what has changed in a file since the last commit. And saw him comment each file separately on his commits. ",
      "mood": "happy",
      "id": 5
    },
    {
      "date": "2020-10-14",
      "concept": "Modern Farm and Career Dev",
      "entry": "We had a Career Dev talk today and found out all of the things they will be expecting of us and helping us with. So exciting! I finished the main part of Modern Farm today and passed all the tests! Also, I think I finally figured out my ssh key issue. ",
      "mood": "excited",
      "id": 6
    }
  ]
}